In [ ]:
# --------> dictionary to Create Data Fame

In [1]:
dict={"Family_members":["Md.Ali","Balkis Jaha","Shahnaz Begum","Irfan","Afzal Shaw","Shakeela Begum","Shamshad Begum","Md.Karamatulla","Shannu","Banu"]}
dict

{'Family_members': ['Md.Ali',
  'Balkis Jaha',
  'Shahnaz Begum',
  'Irfan',
  'Afzal Shaw',
  'Shakeela Begum',
  'Shamshad Begum',
  'Md.Karamatulla',
  'Shannu',
  'Banu']}

In [4]:
import pandas
import pandas as pd
df_fmember=pd.DataFrame(dict)
df_fmember

   Family_members
0          Md.Ali
1     Balkis Jaha
2   Shahnaz Begum
3           Irfan
4      Afzal Shaw
5  Shakeela Begum
6  Shamshad Begum
7  Md.Karamatulla
8          Shannu
9            Banu

In [8]:
dict_Re={"Family_members":["Md.Ali","Balkis Jaha","Shahnaz Begum","Irfan","Afzal Shaw","Shakeela Begum","Shamshad Begum","Md.Karamatulla","Shannu","Banu"], "Relations":["Father","Mother","Sister","Brother","Brother","Sister","Me","Husband","Daugher","Daughter"]}
dict_Re

{'Family_members': ['Md.Ali',
  'Balkis Jaha',
  'Shahnaz Begum',
  'Irfan',
  'Afzal Shaw',
  'Shakeela Begum',
  'Shamshad Begum',
  'Md.Karamatulla',
  'Shannu',
  'Banu'],
 'Relations': ['Father',
  'Mother',
  'Sister',
  'Brother',
  'Brother',
  'Sister',
  'Me',
  'Husband',
  'Daugher',
  'Daughter']}

In [9]:
df_Relations=pd.DataFrame(dict_Re)
df_Relations

   Family_members Relations
0          Md.Ali    Father
1     Balkis Jaha    Mother
2   Shahnaz Begum    Sister
3           Irfan   Brother
4      Afzal Shaw   Brother
5  Shakeela Begum    Sister
6  Shamshad Begum        Me
7  Md.Karamatulla   Husband
8          Shannu   Daugher
9            Banu  Daughter

In [10]:
dict_Fn={"Friend_names": ["Ravi","Shekar","Aliya","Perveen","Khamurunnisa","Salma","Radha","Sridevi","Abbas","Jarina"], "Quality" : ["Talk Active", "Anger", "Intelligent", "Funny", "Good", "Innocent", "Claver", "Singer","Hard Working","Help full"]}
dict_Fn

{'Friend_names': ['Ravi',
  'Shekar',
  'Aliya',
  'Perveen',
  'Khamurunnisa',
  'Salma',
  'Radha',
  'Sridevi',
  'Abbas',
  'Jarina'],
 'Quality': ['Talk Active',
  'Anger',
  'Intelligent',
  'Funny',
  'Good',
  'Innocent',
  'Claver',
  'Singer',
  'Hard Working',
  'Help full']}

In [11]:
df_Fname=pd.DataFrame(dict_Fn)
df_Fname

   Friend_names       Quality
0          Ravi   Talk Active
1        Shekar         Anger
2         Aliya   Intelligent
3       Perveen         Funny
4  Khamurunnisa          Good
5         Salma      Innocent
6         Radha        Claver
7       Sridevi        Singer
8         Abbas  Hard Working
9        Jarina     Help full

In [12]:
dict_Veg={"Veg_items" : ["Potato Fry","Tomato Dal","Pudina Chatny","Cabbage Dal","Lady's Finger Fry","Potato Tomato Curry","Brinjal Curry","Tomato Curry","Sambar","Ridge Guard Curry"],"Rating":[2,1,5,7,3,8,4,9,6,10]}
dict_Veg

{'Veg_items': ['Potato Fry',
  'Tomato Dal',
  'Pudina Chatny',
  'Cabbage Dal',
  "Lady's Finger Fry",
  'Potato Tomato Curry',
  'Brinjal Curry',
  'Tomato Curry',
  'Sambar',
  'Ridge Guard Curry'],
 'Rating': [2, 1, 5, 7, 3, 8, 4, 9, 6, 10]}

In [13]:
df_V=pd.DataFrame(dict_Veg)
df_V

             Veg_items  Rating
0           Potato Fry       2
1           Tomato Dal       1
2        Pudina Chatny       5
3          Cabbage Dal       7
4    Lady's Finger Fry       3
5  Potato Tomato Curry       8
6        Brinjal Curry       4
7         Tomato Curry       9
8               Sambar       6
9    Ridge Guard Curry      10

In [14]:
dict_NVeg={"NVeg_items" :["Matton Curry","Chicken Curry","Matton Khurma","Matton Biryani","Chicken Biryani","Chicken fry","Matton fry","Fish  Curry","Fish fry","Prawns fry"],"Rating":[4,10,3,1,2,8,5,7,6,9]}
dict_NVeg

{'NVeg_items': ['Matton Curry',
  'Chicken Curry',
  'Matton Khurma',
  'Matton Biryani',
  'Chicken Biryani',
  'Chicken fry',
  'Matton fry',
  'Fish  Curry',
  'Fish fry',
  'Prawns fry'],
 'Rating': [4, 10, 3, 1, 2, 8, 5, 7, 6, 9]}

In [15]:
df_NV=pd.DataFrame(dict_NVeg)
df_NV

        NVeg_items  Rating
0     Matton Curry       4
1    Chicken Curry      10
2    Matton Khurma       3
3   Matton Biryani       1
4  Chicken Biryani       2
5      Chicken fry       8
6       Matton fry       5
7      Fish  Curry       7
8         Fish fry       6
9       Prawns fry       9

In [16]:
dict_Fdesti={"City_names" :["Delhi","Mumbai","Kolkata","Chennai","Lacknow","Hyderabad","Varanasi","Bangalure","Ahmedabad","Surat"],"Rating":[4,6,3,5,8,2,7,1,9,10]}
dict_Fdesti

{'City_names': ['Delhi',
  'Mumbai',
  'Kolkata',
  'Chennai',
  'Lacknow',
  'Hyderabad',
  'Varanasi',
  'Bangalure',
  'Ahmedabad',
  'Surat'],
 'Rating': [4, 6, 3, 5, 8, 2, 7, 1, 9, 10]}

In [17]:
df_Cname=pd.DataFrame(dict_Fdesti)
df_Cname

  City_names  Rating
0      Delhi       4
1     Mumbai       6
2    Kolkata       3
3    Chennai       5
4    Lacknow       8
5  Hyderabad       2
6   Varanasi       7
7  Bangalure       1
8  Ahmedabad       9
9      Surat      10